Catalogs/АС_НастройкиИндикацииОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АС_НастройкиИндикацииОстатков</Name>
			<Comment>Общие и индивидуальные пороги цветовой индикации доступного остатка номенклатуры.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Пустое значение используется только у предопределённой общей настройки.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пороги</Name>
					<Comment>Цвет применяется к остатку не больше указанного количества и больше предыдущего порога.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Верхняя включительная граница диапазона остатка.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветHEX</Name>
							<Comment>Цвет фона в формате #RRGGBB.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АС_НастройкиИндикацииОстатков/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АС_НастроитьВидФормы();
	АС_ЗаполнитьЦветаПорогов();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	АС_НастроитьВидФормы();
	АС_ЗаполнитьЦветаПорогов();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить(
		"АС_ИзмененыНастройкиИндикацииОстатков",
		Объект.Ссылка,
		ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПорогиЦветНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Пороги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ИндексСтроки = Объект.Пороги.Индекс(ТекущиеДанные);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"АС_ВыборЦветаЗавершение",
		ЭтотОбъект,
		ИндексСтроки);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Цвет", ТекущиеДанные.Цвет);
	ОткрытьФорму(
		"ОбщаяФорма.ФормаВыбораЦветаУНФ",
		ПараметрыОткрытия,
		ЭтотОбъект,
		,,,
		ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура АС_ВыборЦветаЗавершение(ВыбранныйЦвет, ИндексСтроки) Экспорт

	Если ВыбранныйЦвет = Неопределено Или ВыбранныйЦвет = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	Если ИндексСтроки < Объект.Пороги.Количество() Тогда
		СтрокаПорога = Объект.Пороги[ИндексСтроки];
		СтрокаПорога.Цвет = ВыбранныйЦвет;
		СтрокаПорога.ЦветHEX = АС_HEXПоЦвету(ВыбранныйЦвет);
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_HEXПоЦвету(ВыбранныйЦвет)

	Возврат РаботаСЦветомСервер.HEXПоЦвету(ВыбранныйЦвет);

КонецФункции

&НаСервере
Процедура АС_НастроитьВидФормы()

	ЭтоОбщаяИндикация = Объект.Ссылка =
		ПредопределенноеЗначение("Справочник.АС_НастройкиИндикацииОстатков.ОбщаяИндикация");
	Элементы.Номенклатура.Видимость = Не ЭтоОбщаяИндикация;
	Элементы.ОписаниеОбщейИндикации.Видимость = ЭтоОбщаяИндикация;
	Если ЭтоОбщаяИндикация Тогда
		Заголовок = "Общая индикация остатков";
	Иначе
		Заголовок = "Индикация остатков для товара";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура АС_ЗаполнитьЦветаПорогов()

	Для Каждого СтрокаПорога Из Объект.Пороги Цикл
		Если ПустаяСтрока(СтрокаПорога.ЦветHEX) Тогда
			СтрокаПорога.Цвет = Новый Цвет(255, 255, 255);
		Иначе
			СтрокаПорога.Цвет = РаботаСЦветомСервер.ЦветПоHEX(СтрокаПорога.ЦветHEX);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
